## Análisis de datos - Clase 2

#### Actividad: primera inspección del dataset y sus variables

Importar y hacer una exploración inicial del dataset datasets/datos.csv para responer las preguntas que se encuentran a continuación.
Tip: pueden ser útiles los métodos `head()/tail()`, `info()`, `unique()`,`nunique()`, `value_counts()` y las propiedades `shape` y `columns` de pandas.

**Identificar esta información:**

1. Número de filas y columnas: 
2. Nombres de las columnas: 
3. Variables numéricas (y subtipo): 
4. Variables categóricas (y subtipo): 
5. ¿Tiene datos faltanes el dataset?

In [2]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [3]:
# Importar datasets/datos.csv en un df de Pandas
df = pd.read_csv("../datasets/datos.csv")

In [4]:
# Visualizar las primeras filas del dataset
df.head(10)

,age,workclass,education,marital-status,occupation,sex,capital-gain,hours-per-week,income
0,39,State-gov,Bachelors,Never-married,Adm-clerical,Male,2174,40,<=50K
1,50,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Male,0,13,<=50K
2,38,Private,HS-grad,Divorced,Handlers-cleaners,Male,0,40,<=50K
3,53,Private,11th,Married-civ-spouse,Handlers-cleaners,Male,0,40,<=50K
4,28,Private,Bachelors,Married-civ-spouse,Prof-specialty,Female,0,40,<=50K
5,37,Private,Masters,Married-civ-spouse,Exec-managerial,Female,0,40,<=50K
6,49,Private,9th,Married-spouse-absent,Other-service,Female,0,16,<=50K
7,52,Self-emp-not-inc,HS-grad,Married-civ-spouse,Exec-managerial,Male,0,45,>50K
8,31,Private,Masters,Never-married,Prof-specialty,Female,14084,50,>50K
9,42,Private,Bachelors,Married-civ-spouse,Exec-managerial,Male,5178,40,>50K

In [5]:
# Número de filas y columnas del dataset
df.shape

(32561, 9)

In [6]:
# Nombres de las columnas del dataset
df.columns

Index(['age', 'workclass', 'education', 'marital-status', 'occupation', 'sex',
       'capital-gain', 'hours-per-week', 'income'],
      dtype='object')

In [ ]:
# Información general del dataset
df.describe()

                age  capital-gain  hours-per-week
count  32561.000000  32561.000000    32561.000000
mean      38.581647   1077.648844       40.437456
std       13.640433   7385.292085       12.347429
min       17.000000      0.000000        1.000000
25%       28.000000      0.000000       40.000000
50%       37.000000      0.000000       40.000000
75%       48.000000      0.000000       45.000000
max       90.000000  99999.000000       99.000000

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  object
 2   education       32561 non-null  object
 3   marital-status  32561 non-null  object
 4   occupation      32561 non-null  object
 5   sex             32561 non-null  object
 6   capital-gain    32561 non-null  int64
 7   hours-per-week  32561 non-null  int64
 8   income          32561 non-null  object
dtypes: int64(3), object(6)
memory usage: 2.2+ MB

# Numéricas

- age (continua)
- capital-gain (continua)
- hours-per-week (discreta)

# Categóricas

- workclass (nominal)
- education (ordinal)
- marital-status (nominal)
- occupation (nominal)
- sex (nominal)
- income (ordinal)

In [13]:
df.isnull().sum()

age               0
workclass         0
education         0
marital-status    0
occupation        0
sex               0
capital-gain      0
hours-per-week    0
income            0
dtype: int64

In [12]:
df.isna().sum()

age               0
workclass         0
education         0
marital-status    0
occupation        0
sex               0
capital-gain      0
hours-per-week    0
income            0
dtype: int64

In [15]:
df.nunique()

age                73
workclass           9
education          16
marital-status      7
occupation         15
sex                 2
capital-gain      119
hours-per-week     94
income              2
dtype: int64

In [16]:
df.value_counts()

age  workclass          education      marital-status       occupation          sex      capital-gain  hours-per-week  income
23    Private            HS-grad        Never-married        Adm-clerical        Female  0             40              <=50K     22
33    Private            HS-grad        Married-civ-spouse   Craft-repair        Male    0             40              <=50K     18
35    Private            HS-grad        Married-civ-spouse   Craft-repair        Male    0             40              <=50K     18
23    Private            HS-grad        Never-married        Craft-repair        Male    0             40              <=50K     18
20    ?                  Some-college   Never-married        ?                   Female  0             40              <=50K     18
                                                                                                                                 ..
34    Private            Assoc-acdm     Divorced             Sales               Female  0             45              <=50K      1
                                                             Prof-specialty      Female  0             40              <=50K      1
                                                             Machine-op-inspct   Male    0             40              <=50K      1
                                                             Exec-managerial     Female  0             45              <=50K      1
90    Self-emp-not-inc   Some-college   Married-civ-spouse   Farming-fishing     Male    0             40              <=50K      1
Name: count, Length: 26313, dtype: int64

In [ ]:
# Explorar las variables (por ejemplo los valores únicos)
df["hours-per-week"].unique()

array([40, 13, 16, 45, 50, 80, 30, 35, 60, 20, 52, 44, 15, 25, 38, 43, 55,
       48, 58, 32, 70,  2, 22, 56, 41, 28, 36, 24, 46, 42, 12, 65,  1, 10,
       34, 75, 98, 33, 54,  8,  6, 64, 19, 18, 72,  5,  9, 47, 37, 21, 26,
       14,  4, 59,  7, 99, 53, 39, 62, 57, 78, 90, 66, 11, 49, 84,  3, 17,
       68, 27, 85, 31, 51, 77, 63, 23, 87, 88, 73, 89, 97, 94, 29, 96, 67,
       82, 86, 91, 81, 76, 92, 61, 74, 95], dtype=int64)

In [19]:
df["capital-gain"].unique()

array([ 2174,     0, 14084,  5178,  5013,  2407, 14344, 15024,  7688,
       34095,  4064,  4386,  7298,  1409,  3674,  1055,  3464,  2050,
        2176,   594, 20051,  6849,  4101,  1111,  8614,  3411,  2597,
       25236,  4650,  9386,  2463,  3103, 10605,  2964,  3325,  2580,
        3471,  4865, 99999,  6514,  1471,  2329,  2105,  2885, 25124,
       10520,  2202,  2961, 27828,  6767,  2228,  1506, 13550,  2635,
        5556,  4787,  3781,  3137,  3818,  3942,   914,   401,  2829,
        2977,  4934,  2062,  2354,  5455, 15020,  1424,  3273, 22040,
        4416,  3908, 10566,   991,  4931,  1086,  7430,  6497,   114,
        7896,  2346,  3418,  3432,  2907,  1151,  2414,  2290, 15831,
       41310,  4508,  2538,  3456,  6418,  1848,  3887,  5721,  9562,
        1455,  2036,  1831, 11678,  2936,  2993,  7443,  6360,  1797,
        1173,  4687,  6723,  2009,  6097,  2653,  1639, 18481,  7978,
        2387,  5060], dtype=int64)